# DistributionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..DistributionType Property
Rebar Class See Also
---
The type of rebar distribution(also known as Rebar Set Type).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public DistributionType DistributionType { get; set; }
```

Visual Basic
---
```text
Public Property DistributionType As DistributionType
	Get
	Set
```

Visual C++
---
```text
public:
property DistributionType DistributionType {
	DistributionType get ();
	void set (DistributionType value);
}
```

# Remarks
The possible values of this property are:
  * Uniform
  * VaryingLength

For a uniform distribution type: all bars parameters are the same as the first bar in set. For a varying length distribution type: bars parameters can vary(primarly in length) taking in consideration the constraints of the first bar in set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace